jdi-app/app/controllers/tasks_controller.rb

  def index
    @tasks = Task.includes(:user).rank(:row_order)
    @tasks_desc = Task.includes(:user).order(created_at: :desc)
    @task_all = Task.all
    @archives = Archive.all.order(created_at: :desc)
---
SELECT `tasks`.`id`, `tasks`.`row_order` FROM `tasks` ORDER BY `tasks`.`row_order` DESC LIMIT 1
SELECT `archives`.* FROM `archives` ORDER BY `archives`.`created_at` DESC

  def create
    @task = Task.new(task_params)
    if @task.save
      redirect_to root_path
    else
      @tasks = Task.includes(:user)
---
INSERT INTO `tasks` (`content`, `priority`, `user_id`, `folder_id`, `created_at`, `updated_at`, `row_order`) VALUES ('あああ', NULL, 2, 2, '2023-11-14 16:10:56.256405', '2023-11-14 16:10:56.256405', 0)
SELECT `tasks`.* FROM `tasks`

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 170 LIMIT 1
UPDATE `tasks` SET `tasks`.`content` = 'たまご買う', `tasks`.`updated_at` = '2023-11-25 05:24:59.291406' WHERE `tasks`.`id` = 170

    task = Task.find(params[:id])
    task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 173 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 121

  def destroy_all
    Task.delete_all
    Archive.delete_all
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 1
DELETE FROM `archives`

  def sort
    @task = Task.find(params[:id])
    @task.update(row_order_position: params[:row_order_position])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 187 LIMIT 1
UPDATE `tasks` SET `tasks`.`updated_at` = '2024-01-13 07:38:59.380836', `tasks`.`row_order` = -1073741824 WHERE `tasks`.`id` = 192

    task = Task.find(params[:id])
    done_task = Archive.create(user_id: task.user_id, content: task.content)
    task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 192 LIMIT 1
INSERT INTO `archives` (`content`, `user_id`, `row_order`, `created_at`, `updated_at`) VALUES ('さようならこんばんは', 2, NULL, '2024-01-13 07:39:12.182382', '2024-01-13 07:39:12.182382')
DELETE FROM `tasks` WHERE `tasks`.`id` = 192