app/controllers/users_controller.rb

UPDATE `users` SET `users`.`encrypted_password` = '$2a$12$DxLLP3cHXFVwMYWMHTNEa.vF1LC49sOdin5g.up9Fpg0scFKicyS6', `users`.`updated_at` = '2024-01-13 04:47:30.541234' WHERE `users`.`id` = 2
---
  def update
    if current_user.update(user_params)